<HTML>
<HEAD>
<TITLE>PETSc Vectors</TITLE>
</HEAD>
<BODY BGCOLOR="FFFFFF">

<H2> Vectors </H2>

  PETSc vectors (Vec objects) are used to store the field variables 
in PDE-based (or other) simulations. 

<P>
<H2> Sample </H2>
See <A HREF="${PETSC_DIR}src/vec/examples/tutorials/ex1.c">src/vec/examples/tutorials/ex1.c</A> for sample usage.